In [2]:
import pandas as pd
df = pd.read_csv('Customers.csv', sep=',')
display(df)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [9]:
df['Gender'].value_counts()

Female    1186
Male       814
Name: Gender, dtype: int64

In [10]:
df['Profession'].value_counts()

Artist           612
Healthcare       339
Entertainment    234
Engineer         179
Doctor           161
Executive        153
Lawyer           142
Marketing         85
Homemaker         60
Name: Profession, dtype: int64

# Filtrando para dividir entre homens e mulheres para ver a separação entre eles

In [32]:
df_female = df.loc[df['Gender'] == 'Female']
display(df_female)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
5,6,Female,22,58000,76,Artist,0,2
6,7,Female,35,31000,6,Healthcare,1,3
...,...,...,...,...,...,...,...,...
1991,1992,Female,97,129444,96,Entertainment,5,6
1993,1994,Female,64,175254,100,Artist,9,5
1994,1995,Female,19,54121,89,Engineer,6,3
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7

# Olhando a idade e buscando encontrar algum padrão

In [33]:
df_female['Age'].value_counts()

31    24
52    21
30    20
54    19
91    19
      ..
2      7
73     7
94     6
74     5
42     4
Name: Age, Length: 100, dtype: int64

# Buscando semelhança entre idade, emprego e salario

### Grupo de mulheres aos 3 anos

In [34]:
# Divindo df em 3 tipos de idades 
df_female['Age'].astype('int')
df_female_age30 = df_female.loc[df_female['Age'] < 30]
display(df_female_age30)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
5,6,Female,22,58000,76,Artist,0,2
7,8,Female,23,84000,94,Healthcare,1,3
13,14,Female,24,91000,77,Lawyer,1,1
...,...,...,...,...,...,...,...,...
1974,1975,Female,14,153145,59,Healthcare,8,6
1980,1981,Female,10,86925,76,Artist,7,2
1984,1985,Female,2,153622,51,Lawyer,6,6
1986,1987,Female,4,68094,61,Doctor,4,7
1994,1995,Female,19,54121,89,Engineer,6,3

#### Qual o tipo de emprego e media salarial até os 30 anos

In [36]:
df_female_age30['Profession'].value_counts()

Artist           102
Healthcare        57
Entertainment     38
Lawyer            28
Doctor            28
Executive         26
Engineer          24
Marketing         20
Homemaker         10
Name: Profession, dtype: int64

In [37]:
df_female_age30['Age'].astype('int')
print('Anual sendo = ${:,.2f}'.format(df_female_age30['Annual Income ($)'].mean()))

Anual sendo = $112,483.47

# Calculando media de salário anual das mulheres

In [26]:
print('Anual sendo = ${:,.2f}'.format(df_female['Annual Income ($)'].mean()))
print('Mensal sendo ] ${:,.2f}'.format(df_female['Annual Income ($)'].mean() / 12))

Anual sendo = $110,991.32
Mensal sendo ] $9,249.28